"""
Задание 1. Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.
"""
a = 1
b = 2
print(a)
print(b)
c = int(input("Введи число: "))
print(c)
d = str(input("Введи слово: "))
print(d)
