"""
1. Каждое из слов «разработка», «сокет», «декоратор» представить
в буквенном формате и проверить тип и содержание соответствующих переменных.
Затем с помощью онлайн-конвертера преобразовать
в набор кодовых точек Unicode и также проверить тип и содержимое переменных.

Попытайтесь без конвертера получить кодовые точки и напишите об этом, если у вас получилось
и как вы это сделали?

Подсказки:
--- 'разработка' - буквенный формат
--- '\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430' - набор кодовых точек
--- используйте списки и циклы, не дублируйте функции
"""
words_list = ['разработка', 'сокет', 'декоратор']

for line in words_list:
    print(f'Тип переменной: {format(type(line))}')
    print(f'Содержание переменной: {format(line)}')
    print(f'Длина строки: {format(len(line))}')

# строки, полученные из онлайн конвертера

words_list_2 = [b'\xd1\x80\xd0\xb0\xd0\xb7\xd1\x80\xd0\xb0\xd0\xb1\xd0\xbe\xd1\x82\xd0\xba\xd0\xb0',
                b'\xd1\x81\xd0\xbe\xd0\xba\xd0\xb5\xd1\x82',
                b'\xd0\xb4\xd0\xb5\xd0\xba\xd0\xbe\xd1\x80\xd0\xb0\xd1\x82\xd0\xbe\xd1\x80']
for line in words_list_2:
    print(f'Тип переменной: {format(type(line))}')
    print(f'Содержание переменной: {format(line)}')
    print(f'Длина строки: {format(len(line))}')
